In [5]:
import pandas as pd

In [48]:
log = pd.read_csv('./log.csv', header=None)
log

                                    0                     1        2        3
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN      NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN      NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN      NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN      NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN      NaN
..                                ...                   ...      ...      ...
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0      NaN
996                            #error                   NaN  10054.0  29265.0
997                            #error                   NaN  10454.0      NaN
998                            #error                   NaN   1000.0      NaN
999                            #error                   NaN  10754.0      NaN

[1000 rows x 4 columns]

In [81]:
sample = pd.read_csv('./sample.csv')
sample

            Name         City  Age Profession
0         Иванов       Москва   25     Клинер
1            NaN    Волгоград   31   Менеджер
2         Иванов       Москва   25     Клинер
3        sidorov  Владивосток   43   Менеджер
4        _______        Курск   50   Водитель
5       Кузнецов         Сочи   19    Рабочий
6          Сажин       Сургут   29    Рабочий
7   Котлеревский   Йошкар-Ола   32    Рабочий
8     Завалишина    Чебоксары   36   Менеджер
9         Левина          NaN   55    Рабочий
10          Фикс         Рига   42    Рабочий

In [31]:
# sample.columns = list(map(lambda name: name.lower(), sample.columns))
# sample.columns

Index(['name', 'city', 'age', 'profession'], dtype='object')

In [32]:
'user_id time bet win'.split(' ')

['user_id', 'time', 'bet', 'win']

In [39]:
users=pd.read_csv('./users.csv', encoding='koi8_r', delimiter='\t')
users

      Юзверь                      мейл          Гео
0   User_943       Accumanst@gmail.com       Ижевск
1   User_908         Advismowr@mail.ru       Ижевск
2   User_962           Anachso@ukr.net    Краснодар
3   User_973          Antecia@inbox.ru        Пермь
4   User_902        Balliaryva@ukr.net          NaN
..       ...                       ...          ...
95  User_959  UpdatesCurious@yahoo.com       Тюмень
96  User_901        V2artierso@mail.ru  Арзангелтск
97  User_970          Vashoterlo@bk.ru      Воронеж
98  User_965       Visuareda@yahoo.com      Воронеж
99  User_921              Aavast@ya.ru       Ижевск

[100 rows x 3 columns]

 4.8.1. Задание
0.0/1.0 point (graded)

Создайте новый датафрейм sample2, в который будут входить только записи о людях в возрасте меньше 30 лет.

In [43]:
sample2 = sample[sample.age < 30]

 4.8.2. Задание
0.0/1.0 point (graded)

Создайте новый датафрейм log_win, в который будут входить только записи, где пользователь выиграл. Посчитайте, сколько таких записей, и сохраните в переменной win_count.

In [52]:
log.columns = ['user_id','time', 'bet','win']
log_win = log[log.win > 0]
win_count = len(log_win)

 4.8.3. Задание
0.0/0.9 points (graded)

Создайте новый датафрейм sample2, в который будут входить только записи о рабочих младше 30 лет.

In [55]:
sample2 = sample[(sample.age < 30) & (sample.profession == 'Рабочий')]
sample2

       name    city  age profession
5  Кузнецов    Сочи   19    Рабочий
6     Сажин  Сургут   29    Рабочий

In [58]:
sample.query('age>20')

            name         city  age profession
0         Иванов       Москва   25     Клинер
1            NaN    Волгоград   31   Менеджер
2         Иванов       Москва   25     Клинер
3        sidorov  Владивосток   43   Менеджер
4        _______        Курск   50   Водитель
6          Сажин       Сургут   29    Рабочий
7   Котлеревский   Йошкар-Ола   32    Рабочий
8     Завалишина    Чебоксары   36   Менеджер
9         Левина          NaN   55    Рабочий
10          Фикс         Рига   42    Рабочий

In [62]:
log.columns = ['user_id','time', 'bet','win']
log2 = log.query('bet < 2000 & win > 0')
log2

                              user_id                  time     bet     win
151  Запись пользователя № - user_982  [2019-01-16 21:54:22   100.0  4749.0
189  Запись пользователя № - user_964  [2019-01-21 18:34:44   200.0  4667.0
205  Запись пользователя № - user_931   [2019-01-22 5:26:59   300.0  4319.0
232  Запись пользователя № - user_998   [2019-01-25 8:57:20   500.0  5069.0
265  Запись пользователя № - user_998  [2019-01-29 10:37:55   500.0  6294.0
..                                ...                   ...     ...     ...
962  Запись пользователя № - user_976  [2019-04-19 14:18:45   400.0  5997.0
965  Запись пользователя № - user_900  [2019-04-19 19:31:48   900.0  6767.0
967  Запись пользователя № - user_975  [2019-04-19 22:25:15  1000.0  6108.0
981                            #error                   NaN   800.0  7035.0
991  Запись пользователя № - user_965  [2019-04-20 12:55:41   800.0  6927.0

[113 rows x 4 columns]

In [72]:
# Сохраните в переменную new_log датафрейм, из которого удалены записи с ошибкой в поле user_id:
log = pd.read_csv("log.csv",header=None)
log.columns = ['user_id','time', 'bet','win']
new_log = log[log.user_id != '#error']
new_log

                              user_id                  time      bet     win
0    Запись пользователя № - user_919  [2019-01-01 14:06:51      NaN     NaN
1    Запись пользователя № - user_973  [2019-01-01 14:51:16      NaN     NaN
2    Запись пользователя № - user_903  [2019-01-01 16:31:16      NaN     NaN
3    Запись пользователя № - user_954  [2019-01-01 17:17:51      NaN     NaN
4    Запись пользователя № - user_954  [2019-01-01 21:31:18      NaN     NaN
..                                ...                   ...      ...     ...
991  Запись пользователя № - user_965  [2019-04-20 12:55:41    800.0  6927.0
992  Запись пользователя № - user_967  [2019-04-20 14:59:36  10154.0     NaN
993  Запись пользователя № - user_973  [2019-04-20 17:09:56  10254.0     NaN
994  Запись пользователя № - user_977  [2019-04-20 18:10:07  10354.0     NaN
995  Запись пользователя № - user_984   [2019-04-20 9:59:58   9754.0     NaN

[985 rows x 4 columns]

In [82]:
#  4.11.1. Задание 
# С помощью apply и лямбда-функции увеличьте возраст во всех записях на 1 год и сохраните в sample2:
sample2 = sample.Age.apply(lambda a: a + 1)
sample2

0     26
1     32
2     26
3     44
4     51
5     20
6     30
7     33
8     37
9     56
10    43
Name: Age, dtype: int64

In [96]:
#  4.11.2. Задание
# 0.0/1.0 point (graded)

# С помощью apply и lambda-функции замените все буквы в поле City на маленькие и сохраните в sample2. Вам может понадобиться функция s.lower().

# Обратите внимание: когда в столбце есть пропущенные значения, необходимо в явном виде указывать, что это str.
sample2 =  sample.City.astype(str).apply(lambda city: city.lower())
sample2

0          москва
1       волгоград
2          москва
3     владивосток
4           курск
5            сочи
6          сургут
7      йошкар-ола
8       чебоксары
9             nan
10           рига
Name: City, dtype: object

In [99]:
#  4.11.3. Задание
# 0.0/1.0 point (graded)

# Напишите функцию profession_code, которая на вход получает строку, а на выход возвращает:
#     0 — если на вход поступила строка "Рабочий"
#     1 — если на вход поступила строка "Менеджер"
#     2 — в любом другом случае
code_map = {
    "Рабочий": 0,
    "Менеджер": 1,
}
def profession_code (s):
    if s in code_map:
        return code_map[s]
    return 2

[2, 0, 1]

In [100]:
#  4.11.4. Задание
# 0.0/1.0 point (graded)

# Примените функцию profession_code для того, чтобы заменить поле Profession с помощью apply. Сохраните получившийся датафрейм в переменную sample2.

# Функцию необходимо определить повторно!
sample2 = sample.Profession.apply(profession_code)
sample2

0     2
1     1
2     2
3     1
4     2
5     0
6     0
7     0
8     1
9     0
10    0
Name: Profession, dtype: int64

In [103]:
# 4.11.5. Задание
# 0.0/1.0 point (graded)

# Напишите функцию age_category, которая на вход получает число, а на выход отдаёт:
#     "молодой" — если возраст меньше 23
#     "средний" — если возраст от 23 до 35
#     "зрелый" — если возраст больше 35
def age_category (age):
    if age < 23:
        return "молодой"
    if age <35:
        return "средний"
    return "зрелый"

In [78]:
#  4.11.6. Задание
# 0.0/1.0 point (graded)

# Примените функцию age_category и apply, чтобы создать новую колонку в sample под названием 'Age_category'. Не забудьте загрузить датафрейм.

# Вспомним, как создать новую колонку:
# df['new_column'] = df.old_column.apply(func)
sample['Age_category'] = samplw

In [79]:
#  4.11.7. Задание
# 0.0/1.0 point (graded)

# Преобразуем поле user_id в датафрейме log, оставив только идентификатор пользователя. Например, вместо "Запись пользователя № — user_974" должно остаться только "user_974".

# На месте записей с ошибками в user_id должна быть пустая строка "". Сделайте это через apply и новую функцию, которую вы создадите. Результат сохраните в log:

In [80]:
#  4.11.8. Задание
# 0.0/1.0 point (graded)

# Загрузите log.csv в log. Удалите квадратную скобку из первой строки в столбце time, чтобы привести его к более привычному формату: t равен log.time[0]. Сохраните результат в t:

In [ ]:
#  4.11.9. Задание
# 0.0/1.0 point (graded)

# Уберите ненужную скобку "[" из поля в time. Результат сохраните в log: